# Словарь смайликов погоды
weather_icons = {
    '01d': '☀',
    '02d': '🌤',
    '03d': '⛅',
    '04d': '🌥',
    '09d': '🌧',
    '10d': '🌦',
    '11d': '🌩',
    '13d': '🌨',
    '50d': '🌫',
    '01n': '🌖',
    '02n': '🌖',
    '03n': '🌖',
    '04n': '☁',
    '09n': '🌧',
    '10n': '🌦',
    '11n': '🌩',
    '13n': '🌨',
    '50n': '🌫',
}
# Знак градусов по Цельсию
degree = '\u2103'

# "sign" принимает значение + если температура >=1
sign = lambda x: "+" if x >= 1 else ""

# Коэффициент для конвертации давления из Гекто-Паскаль в мм рт.ст.
hpa_to_mmhg = 0.75

unspecified_city = 'Вначале введите город\n\n' \
                   'Например:\n' \
                   'город Казань\n' \
                   'город Санкт-Петербург\n' \
                   'город Нижний Новгород'
